app/views/car_categories/index.html.erb

    <tbody>
      <% car_category.car_models.each do |car_model| %>
---
SELECT "car_models".* FROM "car_models" WHERE "car_models"."car_category_id" = ?  [["car_category_id", 1]]