app/controllers/car_categories_controller.rb

  def index
    @car_categories = CarCategory.all
---
SELECT "car_categories".* FROM "car_categories"