app/controllers/cars_controller.rb

  def index
    @cars = Car.all
    @manufacturers = Manufacturer.all
    @car_models = CarModel.all
---
SELECT "cars".* FROM "cars"
SELECT "manufacturers".* FROM "manufacturers"
SELECT "car_models".* FROM "car_models"

  def update
    @car = Car.find(params[:id])
---
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    Car.destroy(params[:id])
---
DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", 1]]