app/controllers/rentals_controller.rb

INSERT INTO "rentals" ("code", "start_date", "end_date", "client_id", "car_category_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @rental = Rental.new(params_rental)
    @rental.code = SecureRandom.hex(5)
    @rental.user = current_user

    return redirect_to @rental, notice: t('.success') if @rental.save

SELECT "rentals".* FROM "rentals" ORDER BY "rentals"."status" ASC
---
  def index
    @rentals = Rental.order(status: :asc)

SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def show
    @rental = Rental.find(params[:id])