app/controllers/subsidiaries_controller.rb

SELECT "subsidiaries".* FROM "subsidiaries"
---
  def index
    @subsidiaries = Subsidiary.all