app/models/rental.rb

  def availables_cars
    if car_category && car_category.car_models.present?
---
SELECT "cars".* FROM "cars" WHERE "cars"."car_model_id" IN (SELECT "car_models"."id" FROM "car_models" WHERE "car_models"."car_category_id" = ?)  [["car_category_id", 2]]
SELECT "car_models".* FROM "car_models" WHERE "car_models"."car_category_id" = ?  [["car_category_id", 2]]